artillery/artillery-test.yml
config:
  # Allow overriding target/duration/rate via env: ARTILLERY_TARGET, ARTILLERY_DURATION, ARTILLERY_ARRIVAL_RATE
  target: "{{ $processEnvironment.ARTILLERY_TARGET || 'http://localhost:5174' }}"
  phases:
    - duration: "{{ $processEnvironment.ARTILLERY_DURATION || 45 }}"
      arrivalRate: "{{ $processEnvironment.ARTILLERY_ARRIVAL_RATE || 5 }}"
      name: "Sustain at least 5 concurrent joiners"
  engines:
    socketio:
      transports: ["websocket"]
  plugins:
    expect: {}
  processor: "./processor.js"

scenarios:
  - name: "Players join lobby"
    engine: "socketio"
    flow:
      - function: "ensureGameCode"
      - think: 1
      - emit:
          channel: "join_game"
          data:
            gameCode: "{{ gameCode }}"
            username: "player-{{ $randomNumber(1000, 9999) }}"
            isHost: false
          ack:
            match:
              json: "$.ok"
              value: true
            timeout: 2000
      - think: 5